Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType
An enumerated type listing all connector flow configuration

Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType.Demand
Flow configuration depends on demand

Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType.System
Flow configuration depends on system

Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType.Preset
Flow configuration is Preset

Autodesk.Revit.DB.Plumbing.PipeFlowConfigurationType.Calculated
Flow configuration is calculated